[frmMain]
mnuLanguage.Caption=语言(Language)

pmnuExitTheSystem.Caption=退出系统

mnuSystemSettings.Caption=系统设置
mnuParameterSetting.Caption=参数设置
mnuBootUp.Caption=开机启动
mnuExitTheSystem.Caption=退出系统

mnuReportTools.Caption=报表工具
mnuReportDesign.Caption=报表设计

mnuPrintLog.Caption=查看打印日志


mnuJsonTools.Caption=json效验工具(bejson.com)
mnuBase64.Caption=base64和图片相互转换
mnuUrlEncode.Caption=URL编码/解码
mnuSSLTools.Caption=SSL证书格式转换工具
mnuOpenTheRootDirectory.Caption=打开根目录
mnuOpenReportDirectory.Caption=打开报表目录
mnuOpenLogDirectory.Caption=打开日志目录
mnuOpenTheOutputfileDirectory.Caption=打开输出文件目录
mnuWindowDisplay.Caption=窗口显示
mnuHttpPrint.Caption=HTTP打印
mnuMqttPrint.Caption=MQTT打印
mnuCamera.Caption=摄像头
mnuIdCard.Caption=身份证
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=系统帮助
mnuAboutUs.Caption=关于我们

ts_http_print.Caption=HTTP打印
lblPort.Caption=端口
rb_print.Caption=打印
rb_Preview.Caption=预览
ButtonStart.Caption=启动
ButtonStop.Caption=停止

ts_mqtt_print.Caption=MQTT打印
gb_mqtt.Caption=MQTT服务器
lbl_mqtt_server_address.Caption=地址
lbl_mqtt_server_port.Caption=端口
lbl_mqtt_server_username.Caption=用户名
lbl_mqtt_server_userpwd.Caption=密码
lbl_mqtt_server_subscribe_topic.Caption=订阅主题
lbl_mqtt_server_print_verification_code.Caption=打印验证码
ButtonStart_mqtt.Caption=启动
ButtonStop_mqtt.Caption=停止

ts_camera.Caption=摄像头
lbl_camera_device_list.Caption=设备列表
lbl_camera_resolution.Caption=分辨率
btn_open_camera.Caption=启动摄像头
btn_close_camera.Caption=关闭摄像头
chk_auto_open_camera.Caption=自动启动摄像头
chk_pal_b.Caption=防止闪屏
chk_auto_top.Caption=窗体置顶(总在最前面)


ts_idcard.Caption=身份证
lbl_idcard_name.Caption=姓名
lbl_idcard_sex.Caption=性别
lbl_idcard_nation.Caption=民族
lbl_idcard_birthday.Caption=出生日期
lbl_idcard_id.Caption=身份证号
lbl_idcard_org.Caption=签发机关
lbl_idcard_addr.Caption=住址
lbl_idcard_begin.Caption=有效期起始
lbl_idcard_end.Caption=有效期结束
lbl_idcard_type.Caption=设备类型
btn_idcard_read.Caption=读取
lbl_idcard_msg.Caption=消息提示:

[frmAbout]
btnOk.Caption=确定
Caption=关于

[LanguageString]
ini_NeedRegister=打印次数过多,请重启打印插件或者购买OEM版
ini_NoToken=token值不存在
ini_ReadIdCardError=消息提示: 读卡失败！
ini_GetPrinterList=获取打印机列表
ini_CreateDir=创建目录
ini_FailPleaseCheck=失败,请检查
ini_PrintFailPleaseCheck=打印失败,请检查
ini_ReportFileNotExist=报表文件不存在
ini_DownLoadError=下载出错
ini_JsonFormatError=json格式有误
ini_PrintingTimeoutPleaseCheck=打印超时,请检查
ini_PictureFormatError=图片格式不正确
ini_PdfFileNotExist=pdf文件不存在
ini_PicFileNotExist=pic文件不存在
ini_This=该
ini_NotSupport=不支持
ini_InterfaceCallFailed=接口调用失败
ini_CameraNotActivated=摄像头未启动
ini_SelectFolder=选择文件夹
ini_MinutesMustBeAnInteger=分钟数必须为整数
ini_MinutesMustBeGreaterThanZero=分钟数必须大于零
ini_SelfStartingClientNameCannotBeEmpty=自启动客户端名称不能为空


ini_PdfFileCannotOpen=pdf文件无法打开
ini_LicenseKeyInvalid=许可证密钥无效



ini_PicFileCannotOpen=pic文件无法打开
ini_UnableInitializePrinter=不能初始化打印机
ini_PicPrint=pic打印
ini_PaperSize=纸张大小
ini_CustomMM=自定义(MM)
ini_Width=宽度
ini_Height=高度
ini_PrintingDirection=打印方向
ini_landscape=横向
ini_portrait=竖向
ini_MarginMM=页边距(MM)
ini_Left=左
ini_Right=右
ini_Top=上
ini_Bottom=下
ini_Center=中
ini_VerticalPos=垂直位置
ini_HorizontalPos=水平位置
ini_Copys=份数
ini_DocumentTitle=文档标题
ini_PrinterName=打印机名称
ini_PageZoom=页面缩放
ini_Normal=根据原始图像DPI确定打印尺寸（即创建真实尺寸的副本）
ini_FitToPage=拉伸图像以适合页面，同时尊重其比例
ini_FitToPageStretch=拉伸图像以适合页面，忽略比例
ini_FillPage=拉伸图像以填充整个页面（根据其比例）
ini_SpecifiedSize=以绝对宽度和绝对高度参数指定的绝对大小打印
ini_MultiplePages=以绝对宽度和绝对高度参数指定的计数在多个页面上打印图像（海报）
ini_SpecWidth=绝对宽度
ini_SpecHeight=绝对高度
ini_LoadPic=载入图片
ini_ConfirmPrinting=确认打印



ini_PrintLog=打印日志
ini_Date=日期
ini_Refresh=刷新
ini_OpenLogDirectory=打开日志目录
ini_OpenOutputFileDirectory=打开输出文件目录
ini_ViewCustomFile=查看自定义文件
ini_LogList=日志列表
ini_LogContent=日志内容
ini_PdfFile=pdf文件
ini_Directory=目录
ini_NotExist=不存在



ini_ReportDesign=报表设计
ini_DoubleClickToOpenTheReportFile=双击可以打开报表文件
ini_NewlyAdded=新增
ini_Modify=修改
ini_Delete=删除
ini_Copy=复制
ini_ReportDoesNotExist=报表不存在
ini_To=转为
ini_Error=出错
ini_InTheListBelow_selectTheReportFileYouWantToModify=请在下方列表中,选择要修改的报表文件
ini_TestReport=测试报表
ini_AreYouSureYouWantToDelete=是否确认删除吗
ini_DeleteConfirmation=删除确认
ini_YouHaveChosenNotToDelete=您选择了不删除
ini_ReportNameEn=报表名称(英文)
ini_ReportNameAlias=报表名称(别名)
ini_VersionNumber=版本号
ini_FileNameSuffixMustBe=文件名后缀必须为
ini_Currently=当前为
ini_TheFileNameAlreadyExists=该文件名已经存在
ini_ReportInfo=报表信息


ini_NoJsonFile=缺少json文件
ini_PrintErrorJsonError=打印失败,json格式有误
ini_MustBe=必须为
ini_Or=或者
ini_ReportName=报表名称
ini_CannotBeEmpty=不能为空
ini_MustBeIntOrFloat=必须为小数或整数类型
ini_DeleteLocalReportFile=删除本地报表文件
ini_DownLoadReportFileToLocal=下载远程报表到本地
ini_DownLoadReportFileError=下载报表文件出错
ini_DownLoadComplete=下载完成
ini_EditLocalReportVersion=修改本地报表版本号
ini_CreateReportFile=创建报表文件
ini_PrintCopys=打印份数
ini_MustBeInt=必须为整数类型
ini_MustBeGreaterThanOrEqualTo=必须大于等于零
ini_DetermineIfThePrinterExists=判断打印机是否存在
ini_Printer=打印机
ini_NotExistPayAttentionToCaseAndSpace=不存在,请注意大小写 和 空格
ini_SetRightOffset=设置 右偏移
ini_MustBeFloat=必须为浮点类型
ini_SetBottomOffset=设置底部偏移
ini_MustBeOneOrZero=必须为1或者0
ini_SetComponent=设置 部件框
ini_Component=部件框
ini_ControlToArrayError=Control 转为 array 出错 
ini_LoadPicError=加载图片出错
ini_FormatError=格式有误
ini_Parameter=参数
ini_ParameterToArrayError=Parameter 转为 array 出错
ini_Field=字段
ini_FieldToArrayError=Field 转为 array 出错
ini_AFieldToArrayError=AField 转为 array 出错
ini_BFieldToArrayError=BField 转为 array 出错
ini_CFieldToArrayError=CField 转为 array 出错
ini_DFieldToArrayError=DField 转为 array 出错
ini_EFieldToArrayError=EField 转为 array 出错
ini_FFieldToArrayError=FField 转为 array 出错
ini_GFieldToArrayError=GField 转为 array 出错
ini_HFieldToArrayError=HField 转为 array 出错
ini_IFieldToArrayError=IField 转为 array 出错
ini_JFieldToArrayError=JField 转为 array 出错
ini_DataRow=数据行
ini_DataToArrayError=Data 转为 array 出错
ini_ADataToArrayError=AData 转为 array 出错
ini_BDataToArrayError=BData 转为 array 出错
ini_CDataToArrayError=CData 转为 array 出错
ini_DDataToArrayError=DData 转为 array 出错
ini_EDataToArrayError=EData 转为 array 出错
ini_FDataToArrayError=FData 转为 array 出错
ini_GDataToArrayError=GData 转为 array 出错
ini_HDataToArrayError=HData 转为 array 出错
ini_IDataToArrayError=IData 转为 array 出错
ini_JDataToArrayError=JData 转为 array 出错
ini_SetOffsetValue=设置偏移值
ini_SetPrinterName=设置打印机名称
ini_ExportFileYes=是否导出文件 是
ini_ExportFileName=导出文件名称
ini_ExportComplete=导出完毕
ini_PreviewComplete=预览完毕
ini_PrintComplete=打印完毕
ini_LoadReport=加载报表
ini_ADataToArraySuccess=AData 转为 array 成功
ini_BDataToArraySuccess=BData 转为 array 成功
ini_CDataToArraySuccess=CData 转为 array 成功
ini_DDataToArraySuccess=DData 转为 array 成功
ini_EDataToArraySuccess=EData 转为 array 成功
ini_FDataToArraySuccess=FData 转为 array 成功
ini_GDataToArraySuccess=GData 转为 array 成功
ini_HDataToArraySuccess=HData 转为 array 成功
ini_IDataToArraySuccess=IData 转为 array 成功
ini_JDataToArraySuccess=JData 转为 array 成功




ini_NoClientID=没有clientid的值
ini_ClientIDEmpty=clientid不能为空
ini_PrinteridWrong=printerid不对
ini_PrinterpwdWrong=printerpwd不对
ini_MethodWrong=method不正确
ini_PingSuccessful=ping成功
ini_PingTimeout=ping超时
ini_ConnectionResults=连接结果
ini_subscribeResultMessageID=订阅结果，消息ID
ini_UnsubscribeResultMessageID=取消订阅结果，消息ID
ini_Received_release_confirmation_QoS_1_message_ID=收到发布确认Qos 1，消息ID
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=收到发布确认Qos 2 第1步，消息ID
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=收到发布确认Qos 2 第3步，消息ID
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=收到发布确认Qos 2 第2步，消息ID
ini_ConnectionTimedOut=连接超时
ini_PublishingTimeout=发布超时
ini_MessageID=消息ID
ini_Topic=主题
ini_Content=内容
ini_CameraOn=摄像头已打开
ini_OpenFailed=打开失败
ini_NoVideoDevicesWereFound=没有找到视频设备
ini_Stopped=已停止
ini_CameraStartFailed=摄像头启动失败
ini_CameraOff=摄像头已关闭
ini_Disconnect=断开连接
ini_Started=已启动
ini_Failed_to_start_Please_try_another_port=启动失败,请换个端口试试
ini_Minimum_desktop_requirements_Windows_Vista=桌面版最低要求:Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=服务器最低要求:Windows Server 2008

ini_Table_structure_field_type=表结构 字段类型 ftBlob (base64格式) ,ftString ftInteger ftBoolean, ftFloat, ftCurrency,ftDateTime,  
ini_size_ftString_ftInteger_ftBlob=Size (ftString 设置为实际长度,其他的设置为0,例如 ftInteger ftBlob 等设置为0 ) 
ini_Currently_10_tables_are_supported=当前支持 10个 表  ABCDEFGHIJ 例如 表A 包含 AField  AData  一直到  表J 包含 JField  JData  



ini_ParameterSetting=参数设置
ini_Log_save_path_if_empty_the_default_is_log_directory=日志保存路径(为空 默认为 log 目录)
ini_Clear_log_on_startup=启动时清空日志
ini_Clear_log_on_exit=退出时清空日志
ini_In_operation_every=运行中,每隔XX分钟,清空一次
ini_Save_settings=保存设置
ini_journal=日志
ini_report_form=报表
ini_Report_template_path_empty_default_report_directory=报表模板路径(为空 默认 report 目录)
ini_Export_file_path_empty_default_export_directory=导出文件路径(为空 默认 export 目录)
ini_Export_file_format_blank_default_PDF_format=导出文件格式(为空 默认 pdf格式)
ini_Enable_token=启用token
ini_Token_list_one_for_each_line_similar_to_white_list=token列表(一行一个,类似白名单)
ini_other=其他
ini_Minimize_after_startup=启动后最小化
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=自定义客户端名称,让其可以启动多个客户端



ini_URL_encoding_decoding=URL编码/解码
ini_URLEncode=UrlEncode编码
ini_URLDecode=UrlDecode解码






ini_Base64_and_image_conversion=base64和图片相互转换
ini_exceed_100k=为了平衡在生产环境中的效率，一般单个图片文件不要超过100K。
ini_Base64_string=base64字符串
ini_paste=粘贴
ini_Turn_to_picture=转为图片
ini_picture=图片

ini_Connection=连接
ini_write_log=生成日志